from make_answer.chat.chat_invoker import ChatInvoker


def drug_1(prompt_type:int,data: dict, llm: ChatInvoker) -> dict:

    zero_shot_prompt = f'请回答以下填空题，要求只返回填空内容，不需要给出解释，严格使用医学专业表达。注意：如果有多个空，不同回答之间用逗号隔开。题目为：{data["question"]}'
    few_shot_prompt=f'''
    请回答以下填空题，要求只返回填空内容，不需要给出解释，严格使用医学专业表达。
    ##注意：如果有多个空，不同回答之间用逗号隔开。
    ##请参考以下示例：
    #示例一：
    【问题】：制川乌的常用内服剂量是________。
    【答案】：1.5～3g
    #示例二：
    【问题】：马钱子的毒性分类是______（有小毒/有毒/有大毒），其每日服用剂量应控制在______左右。
    【答案】：有大毒；0.3～0.9g
    #示例三：
    【问题】：孕妇禁用斑蝥的原因是______。
    【答案】：有大毒，可致流产
    #请你参考以上示例，回答下面问题，题目为：{data["question"]}
    '''
    cot_prompt = f'''
    请回答以下填空题，要求只返回填空内容，不需要给出解释，严格使用医学专业表达。
    ##注意：如果有多个空，不同回答之间用逗号隔开。
    ##请参考以下示例：
    #示例一：
    【问题】：制川乌的常用内服剂量是________。
    【推理过程】：
    1.川乌为乌头类药材，具有强烈的毒性，未经炮制不可内服。
    2.制川乌是炮制后的川乌，毒性减弱后可以入药使用。
    3.中医临床中使用制川乌须严格控制剂量，以防中毒。
    4.根据《中华人民共和国药典》等标准资料，制川乌的安全内服剂量为1.5～3克。
    5.超过此剂量容易引发中毒反应，如肢体麻木、心律紊乱等。
    【答案】：1.5～3g
    #示例二：
    【问题】：马钱子的毒性分类是______（有小毒/有毒/有大毒），其每日服用剂量应控制在______左右。
    【推理过程】：
    1.马钱子含有士的宁等生物碱，毒性强烈，对中枢神经系统有刺激作用。
    2.其毒性反应包括肌肉痉挛、抽搐、呼吸困难等，临床使用风险较高。
    3.在《药典》及中药教材中明确将其归为“有大毒”之列。
    4.由于毒性大，马钱子的每日服用剂量必须严格控制。
    5.通常的安全剂量范围为0.3～0.9克。
    【答案】：有大毒；0.3～0.9g
    #示例三：
    【问题】：孕妇禁用斑蝥的原因是______。
    【推理过程】：
    1.斑蝥是一种常用于攻毒蚀疮、破瘀通经的药物，药性猛烈。
    2.含有强烈毒性的斑蝥素，对黏膜和肌肉组织有强刺激性。
    3.斑蝥能强烈活血通经，有显著的堕胎作用。
    4.孕妇服用后极易导致子宫收缩、出血甚至流产。
    5.因此，中医药典中明确指出孕妇禁用斑蝥。
    【答案】：有大毒，可致流产
    #请你参考以上思考方式，回答下面问题，题目为：{data["question"]}
    '''
    match prompt_type:
        case 0:
            prompt = zero_shot_prompt
        case 1:
            prompt = few_shot_prompt
        case 2:
            prompt = cot_prompt
        case _:
            prompt = ""
    response = llm.chat(prompt)
    data["answer"] = response

    return data