from make_answer.chat.chat_invoker import ChatInvoker


def tcm_ft(prompt_type:int,data: dict, llm: ChatInvoker) -> dict:
    zero_shot_prompt = f"用一段话回答这个问题，不能使用分点论述，需要尽可能的总结。{data['question']}"
    few_shot_prompt = f'''
    请用一段话回答这个问题，不能使用分点论述，需要尽可能总结凝练。
    ##请参考以下示例：
    #示例一:
    【题目】：何谓血瘀?血瘀是如何形成的?  
    【答案】：血瘀，指血液的循行迟缓和流行失畅的病理状态。血瘀多由于气滞而血行闭阻；气虚而血运迟缓；痰浊阻络而血运失畅；阳虚或寒邪阻滞血脉、血寒而凝；邪热入血，煎熬津液，津液干涸而致瘀等因素而形成。
    #示例二：  
    【题目】：肾“其华在发”有何理论依据?  
    【答案】：发的生长，全赖于精和血。肾藏精，而精血可以互化，发的生长和脱落，润泽与枯槁，有赖于肾中精气之充养，故说肾其华在发，发又依赖于血的濡养，故称“发为血之余”。肾中精气充盈，血有所化，发得所养，生长旺盛而有光泽。故说肾“其华在发”。
    #示例三： 
    【题目】：奇经八脉有何主要生理功能?  
    【答案】：奇经八脉的主要生理功能有：①加强十二经脉之间的沟通和联系。②调节十二经脉的气血。③与脑、髓、女子胞等关系较为密切，在生理、病理上均有一定的关系。
    #请用一段话总结并回答：{data['question']}
'''
    cot_prompt = f'''
    请用一段话回答这个问题，不能使用分点论述，需要尽可能总结凝练。
    ##请参考以下示例及其推理过程：
    #示例一:
    【题目】：何谓血瘀?血瘀是如何形成的?  
    【推理过程】：血瘀是指血液运行不畅或停滞的病理现象，形成原因包括气滞、气虚、寒凝、热扰、外伤等。气滞会导致血行闭阻，气虚则使血行无力，寒邪使血液凝滞，热邪灼伤津液也可致血瘀。  
    【答案】：血瘀，指血液的循行迟缓和流行失畅的病理状态。血瘀多由于气滞而血行闭阻；气虚而血运迟缓；痰浊阻络而血运失畅；阳虚或寒邪阻滞血脉、血寒而凝；邪热入血，煎熬津液，津液干涸而致瘀等因素而形成。
    #示例二：  
    【题目】：肾“其华在发”有何理论依据?  
    【推理过程】：肾藏精，精化生血，血濡养毛发，二者关系密切。发的生长依赖于肾精充盈与血的濡养，若肾精不足或血虚，则毛发枯槁脱落，反之则乌黑茂密。  
    【答案】：发的生长，全赖于精和血。肾藏精，而精血可以互化，发的生长和脱落，润泽与枯槁，有赖于肾中精气之充养，故说肾其华在发，发又依赖于血的濡养，故称“发为血之余”。肾中精气充盈，血有所化，发得所养，生长旺盛而有光泽。故说肾“其华在发”。
    #示例三： 
    【题目】：奇经八脉有何主要生理功能?  
    【推理过程】：奇经八脉不同于十二经脉，它们不直接隶属脏腑，但起着沟通、调节、储蓄的作用。它们在协调气血流通、维持整体阴阳平衡，特别是与脑、髓、胞宫等特殊器官有密切关系。  
    【答案】：奇经八脉的主要生理功能有：①加强十二经脉之间的沟通和联系。②调节十二经脉的气血。③与脑、髓、女子胞等关系较为密切，在生理、病理上均有一定的关系。
    #请你参考以上思考方式，用一段话总结并回答：{data['question']}
'''
    match prompt_type:
        case 0:
            prompt = zero_shot_prompt
        case 1:
            prompt = few_shot_prompt
        case 2:
            prompt = cot_prompt
        case _:
            prompt = ""

    response = llm.chat(prompt)
    data["answer"] = response

    return data
