import re

from make_answer.chat.chat_invoker import ChatInvoker


def tcm_frd(prompt_type:int,data: dict, llm: ChatInvoker) -> dict:
    zero_shot_prompt = f'''
        请从以下的中医中证的表现，运用中医知识，得出治法、方剂名、药物组成，并完成下面的表单：
        ##表单内容：
        治法：
        方剂名：
        药物组成：不需要给出剂量。
        ##注意：
        1.禁用口语化表达，严格使用医学专业表达。
        2.输出格式与信息抽取的表单一致，用json格式返回，不要输出其它格式，禁用markdown格式。
        证的表现：{data["question"]}，请完成上述表单。
    '''
    few_shot_prompt = f'''
    请从以下的中医中证的表现，运用中医知识，得出治法、方剂名、药物组成，并完成下面的表单：
    ##表单内容：
    治法：
    方剂名：
    药物组成：不需要给出剂量。
    ##注意：
    1.禁用口语化表达，严格使用医学专业表达。
    2.输出格式与信息抽取的表单一致，用json格式返回，不要输出其它格式，禁用markdown格式。
    ##请参考以下示例：
    #示例一：
    【证的表现】:恶寒重，发热轻，头痛，无汗，肢体酸楚，肢体疼痛，鼻塞，打喷嚏，流清涕，咽痒，咳嗽，咳痰，痰稀，痰色白，口不渴，或渴喜热饮，苔薄，苔白，苔润，脉浮，脉紧。
    【答案】：
    "治法": "辛温解表，宣肺散寒", "方剂": "荆防败毒散或荆防达表汤", "药物组成": "荆芥、防风、茯苓、羌活、独活、柴胡、前胡、川芎、枳壳、桔梗、甘草"
    #示例二：
    【证的表现】：咳嗽，气粗，咳声嘶哑，喉燥，咽干，咽痛，咳痰不爽，痰黏稠，痰黄，咳时汗出，流黄涕，口渴，头痛，恶风，身热，舌红，苔薄，苔黄，脉浮，脉数，脉滑。
    【答案】："治法": "疏风清热，宣肺止咳", "方剂": "桑菊饮", "药物组成": "桑叶、菊花、杏仁、连翘、薄荷、桔梗、芦根、甘草"
    #示例三：
    【证的表现】:干咳，咳声短促，痰少，痰黏稠，痰白，或痰中带血，声音嘶哑，口干，咽燥，午后潮热，颧红，盗汗，消瘦，神疲，乏力，舌红，苔少，脉细，脉数。
    【答案】："治法": "养阴清热，润肺止咳", "方剂": "沙参麦冬汤", "药物组成": "沙参、麦冬、天花粉、玉竹、桑叶、白扁豆、甘草"
    #请你参考以上示例，从以下中医中证的表现：{data["question"]}，运用中医知识，得出治法、方剂名、药物组成，并完成上面的表单。
    '''
    cot_prompt=f'''
    请从以下的中医中证的表现，运用中医知识，得出治法、方剂名、药物组成，并完成下面的表单：
    ##表单内容：
    治法：
    方剂名：
    药物组成：不需要给出剂量。
    ##注意：
    1.禁用口语化表达，严格使用医学专业表达。
    2.输出格式与信息抽取的表单一致，用json格式返回，不要输出其它格式，禁用markdown格式。
    ##请参考以下示例：
    #示例一：
    【证的表现】:恶寒重，发热轻，头痛，无汗，肢体酸楚，肢体疼痛，鼻塞，打喷嚏，流清涕，咽痒，咳嗽，咳痰，痰稀，痰色白，口不渴，或渴喜热饮，苔薄，苔白，苔润，脉浮，脉紧。
    【推理过程】:
    1.症状辨识:
    恶寒重，发热轻: 典型的外感寒邪症状。
    头痛，肢体酸楚，肢体疼痛: 表现为寒邪侵犯表层。
    鼻塞，打喷嚏，流清涕，咽痒，咳嗽: 这些都是感冒或外风寒症状。
    咳痰，痰稀，痰色白: 白色稀痰符合风寒侵袭肺部的表现。
    口不渴，或渴喜热饮: 不渴且偏好热饮，有助于驱寒。
    舌苔薄，白，润，脉浮，脉紧: 这些都是风寒证的表现，舌苔白润与寒湿邪气相关，脉浮紧为外寒表证的标志。
    2.治法:该病属于风寒束表，需辛温解表，宣肺散寒。
    3.方剂推荐:荆防败毒散或荆防达表汤：这些方剂能有效解表散寒，宣肺止咳。
    4.药物组成:荆芥、防风、茯苓、羌活、独活、柴胡、前胡、川芎、枳壳、桔梗、甘草。
    5.结论:治法为辛温解表，宣肺散寒。推荐方剂为荆防败毒散或荆防达表汤，药物组成包括荆芥、防风、茯苓等。
    【答案】：
    "治法": "辛温解表，宣肺散寒", "方剂": "荆防败毒散或荆防达表汤", "药物组成": "荆芥、防风、茯苓、羌活、独活、柴胡、前胡、川芎、枳壳、桔梗、甘草"
    #示例二：
    【证的表现】：咳嗽，气粗，咳声嘶哑，喉燥，咽干，咽痛，咳痰不爽，痰黏稠，痰黄，咳时汗出，流黄涕，口渴，头痛，恶风，身热，舌红，苔薄，苔黄，脉浮，脉数，脉滑。
    【推理过程】:
    1.症状辨识:
    咳嗽，气粗，咳声嘶哑: 咳嗽是症状之一，声嘶和气粗提示肺部有热邪。
    喉燥，咽干，咽痛: 喉部干燥和痛感，可能伴有上呼吸道感染。
    咳痰不爽，痰黏稠，痰黄: 痰黄而黏稠表明热邪侵犯肺部。
    咳时汗出，流黄涕: 黄涕和汗出提示风热侵袭。
    口渴，头痛，恶风，身热: 身热与口渴是热证的典型表现。
    舌红，苔薄，苔黄: 舌红苔黄符合热证的表现。
    脉浮，脉数，脉滑: 脉滑与脉数表明热邪存在，风热证的表现。
    2.治法:疏风清热，宣肺止咳。
    3.方剂推荐:桑菊饮: 该方能够有效地疏风清热，宣肺止咳。
    4.药物组成:桑叶、菊花、杏仁、连翘、薄荷、桔梗、芦根、甘草。
    5.结论:治法为疏风清热，宣肺止咳。推荐方剂为桑菊饮，药物组成包括桑叶、菊花等。
    【答案】："治法": "疏风清热，宣肺止咳", "方剂": "桑菊饮", "药物组成": "桑叶、菊花、杏仁、连翘、薄荷、桔梗、芦根、甘草"
    #示例三：
    【证的表现】:干咳，咳声短促，痰少，痰黏稠，痰白，或痰中带血，声音嘶哑，口干，咽燥，午后潮热，颧红，盗汗，消瘦，神疲，乏力，舌红，苔少，脉细，脉数。
    【推理过程】:
    1.症状辨识:
    干咳，咳声短促，痰少: 痰少且黏稠是阴虚火旺的表现。
    痰白，或痰中带血: 痰中带血有可能提示肺阴虚导致的气机不畅。
    声音嘶哑，口干，咽燥: 嘶哑声音和口干、咽燥属于阴虚症状。
    午后潮热，颧红，盗汗: 午后潮热、盗汗及颧红都是阴虚火旺的标志。
    消瘦，神疲，乏力: 长期消瘦，神疲乏力常见于阴虚体质。
    舌红，苔少，脉细，脉数: 舌红苔少与脉细数表明阴虚火旺。
    2.治法:养阴清热，润肺止咳。
    3.方剂推荐:沙参麦冬汤: 该方能够滋养肺阴，清热润肺，缓解干咳症状。
    4.药物组成:沙参、麦冬、天花粉、玉竹、桑叶、白扁豆、甘草。
    5.结论:治法为养阴清热，润肺止咳。推荐方剂为沙参麦冬汤，药物组成包括沙参、麦冬等。
    【答案】："治法": "养阴清热，润肺止咳", "方剂": "沙参麦冬汤", "药物组成": "沙参、麦冬、天花粉、玉竹、桑叶、白扁豆、甘草"
    #请你参考以上思考方式，从以下的中医中证的表现：{data["question"]}，运用中医知识，得出治法、方剂名、药物组成，并完成上面的表单。
    '''
    match prompt_type:
        case 0:
            prompt = zero_shot_prompt
        case 1:
            prompt = few_shot_prompt
        case 2:
            prompt = cot_prompt
        case _:
            prompt = ""
    response = llm.chat(prompt)
    data["answer"] = response
    return data
