from make_answer.chat.chat_invoker import ChatInvoker


def tcm_diagdata(prompt_type:int,data: dict, llm: ChatInvoker) -> dict:
    zero_shot_prompt=f'''
    请根据以下中医中证的表现，得出疾病名称、证名、病位、病性，并完成下述表单：
    ##表单内容
    "疾病名称": ,
    "证名": ,
    "病位": ,
    "病性":
    ##注意：
    1.禁用口语化表达，严格使用医学专业表达。
    2.输出格式与信息抽取的表单一致，以json格式返回，不要输出其它格式，禁用markdown格式。
    证的表现为：{data["question"]}，请完成上述表单。
'''
    few_shot_prompt = f'''
    请根据以下中医中证的表现，得出疾病名称、证名、病位、病性，并完成下述表单：
    ##表单内容
    "疾病名称": ,
    "证名": ,
    "病位": ,
    "病性":
    ##注意：
    1.禁用口语化表达，严格使用医学专业表达。
    2.输出格式与信息抽取的表单一致，以json格式返回，不要输出其它格式，禁用markdown格式。
    ##请参考下面的示例：
    【示例一】
    证的表现：恶寒重，发热轻，头痛，无汗，肢体酸楚，肢体疼痛，鼻塞，打喷嚏，流清涕，咽痒，咳嗽，咳痰，痰稀，痰色白，口不渴，或渴喜热饮，苔薄，苔白，苔润，脉浮，脉紧。
    答案："疾病名称": "感冒", "病位证素": "表、肺", "病性证素": "外风、寒", "证名": "风寒束表"
    【示例二】
    证的表现：咳嗽，气粗，咳声嘶哑，喉燥，咽干，咽痛，咳痰不爽，痰黏稠，痰黄，咳时汗出，流黄涕，口渴，头痛，恶风，身热，舌红，苔薄，苔黄，脉浮，脉数，脉滑。
    答案：疾病名称": "咳嗽", "病位证素": "表、肺", "病性证素": "外风、热", "证名": "风热犯肺"
    【示例三】
    证的表现：干咳，咳声短促，痰少，痰黏稠，痰白，或痰中带血，声音嘶哑，口干，咽燥，午后潮热，颧红，盗汗，消瘦，神疲，乏力，舌红，苔少，脉细，脉数。
    答案："疾病名称": "咳嗽", "病位证素": "肺", "病性证素": "阴虚", "证名": "肺阴亏耗"
    #请你参考以上示例，从以下中医中证的表现：{data["question"]}，得出疾病名称、证名、病位、病性，请完成上述表单。
    '''
    cot_prompt = f'''
        请根据以下中医中证的表现，得出疾病名称、证名、病位、病性，并完成下述表单：
        ##表单内容
        "疾病名称": ,
        "证名": ,
        "病位": ,
        "病性":
        ##注意：
        1.禁用口语化表达，严格使用医学专业表达。
        2.输出格式与信息抽取的表单一致，以json格式返回，不要输出其它格式，禁用markdown格式。
        ##请参考下面的示例：
        【示例一】
        证的表现：恶寒重，发热轻，头痛，无汗，肢体酸楚，肢体疼痛，鼻塞，打喷嚏，流清涕，咽痒，咳嗽，咳痰，痰稀，痰色白，口不渴，或渴喜热饮，苔薄，苔白，苔润，脉浮，脉紧。
        推理过程：1.患者表现为恶寒重、发热轻，头痛、肢体酸楚，鼻塞、打喷嚏、流清涕等症状，表明外邪侵袭，符合风寒入侵之证。
                2.没有明显的口渴，苔薄白，脉浮紧，提示外寒引起的病理变化，风寒束表，导致气血运行不畅。
                3.咳嗽、咳痰、流清涕和咽痒等症状，进一步指向了肺部受外寒影响，风寒入侵肺络，致使肺气不宣。
                4.由此可推测疾病位于表、肺，病性为外风、寒，证名为风寒束表。
        答案："疾病名称": "感冒", "病位证素": "表、肺", "病性证素": "外风、寒", "证名": "风寒束表"
        【示例二】
        证的表现：咳嗽，气粗，咳声嘶哑，喉燥，咽干，咽痛，咳痰不爽，痰黏稠，痰黄，咳时汗出，流黄涕，口渴，头痛，恶风，身热，舌红，苔薄，苔黄，脉浮，脉数，脉滑。
        推理过程：1.患者咳嗽伴气粗，咳声嘶哑，咳痰黏稠且痰色黄，提示体内热邪内生，肺气不畅。
                2.咳嗽时汗出、流黄涕，表明风热邪气正在犯肺，导致肺气不宣，痰液湿热困肺。
                3.舌红、苔薄黄、脉浮数等症象，进一步加重了风热侵犯肺部的证据。
                4.此类症状符合表、肺为病位，外风与热为病性，证名为风热犯肺。
        答案：疾病名称": "咳嗽", "病位证素": "表、肺", "病性证素": "外风、热", "证名": "风热犯肺"
        【示例三】
        证的表现：干咳，咳声短促，痰少，痰黏稠，痰白，或痰中带血，声音嘶哑，口干，咽燥，午后潮热，颧红，盗汗，消瘦，神疲，乏力，舌红，苔少，脉细，脉数。
        推理过程：1.患者干咳、咳声短促，痰黏稠、痰中带血，提示肺部阴虚导致肺润不足，气道干燥。
                2.伴有午后潮热、颧红、盗汗、消瘦等症状，进一步加深了阴虚火旺的病理特征。
                3.舌红、苔少、脉细数等症状提示阴虚火旺，脉象细数是阴虚的典型表现。
                4.综合症状推测疾病位于肺，病性为阴虚，证名为肺阴亏耗。
        答案："疾病名称": "咳嗽", "病位证素": "肺", "病性证素": "阴虚", "证名": "肺阴亏耗"
        #请你参考以上思考方式，从以下中医中证的表现：{data["question"]}，得出疾病名称、证名、病位、病性，请完成上述表单。
    '''
    match prompt_type:
        case 0:
            prompt = zero_shot_prompt
        case 1:
            prompt = few_shot_prompt
        case 2:
            prompt = cot_prompt
        case _:
            prompt = ""
    response = llm.chat(prompt)
    data["answer"] = response

    return data
