import re

from make_answer.chat.chat_invoker import ChatInvoker


def tcm_pr(prompt_type:int,data: dict, llm: ChatInvoker) -> dict:
    zero_shot_prompt = f'''
        请根据患者的基本信息和健康情况，给患者推荐一组中草药用作中药处方。
        ##注意：
        1.用数组形式输出推荐的一组中草药，不要输出其他格式和内容
        2.严格使用医学专业表达
        3.禁用markdown格式
        请从以下患者的临床信息中推荐一组中草药用作中药处方：{data["disease_case"]}
    '''
    few_shot_prompt = f'''
    请根据患者的基本信息和健康情况，给患者推荐一组中草药用作中药处方。
    ##注意：
    1.用数组形式输出推荐的一组中草药，不要输出其他格式和内容
    2.严格使用医学专业表达
    3.禁用markdown格式
    ##请参考以下示例：
    【患者的临床信息】："性别": "男", "职业": "职员", "年龄": "45岁", "婚姻": "已婚", "病史陈述者": "本人", "发病节气": "清明", "主诉": "发作性胸闷，烦躁2年余，加重1月余", "症状": "胸闷心慌，烦躁不适，纳呆腹胀，纳差，眠差易醒，二便调。", "中医望闻切诊": "中医望闻切诊：表情自然，面色红润，形体正常，望态，语气清，气息平，无异常气味，舌红、苔黄腻,舌下脉络正常,脉弦。", "病史": "现病史，患者于1月前因无明显诱因出现胸闷，烦躁，伴随心慌，烦躁不适，纳呆腹胀，遂就诊于我院。既往史，“胃溃疡”4年余，“颈椎病”2年余，冠心病1年余、否认糖尿病等慢性疾病病史，否认肝炎、否认结核等传染病史，预防接种史不详，否认手术史、否认重大外伤史，否认输血史，否认药物过敏史、否认其他接触物过敏史，个人史，生于原籍，久居本地，无疫水、疫源接触史，无嗜酒史，无吸烟史，无放射线物质接触史，否认麻醉毒品等嗜好，否认冶游史，否认食物过敏史，否认传染病史，婚育史，适龄婚育，育有2个子女，配偶及子女均体健，家族史，父亲去世，母亲健在，母体健，有1弟1妹，弟体健，妹高血压，祖辈均有高血压病史。", "体格检查": "体温：36.2℃  脉搏：62次/分  呼吸：18次/分  血压：134/78mmHg  VTE评估类型点选评分：0分    卒中风险评估：低危患者中年男性，发育正常，营养良好，神志清楚，自主步入病房，查体合作，全身皮肤及粘膜无黄染，未见皮下出血,浅表淋巴结未及肿大。头颅五官无畸形，眼睑无水肿，巩膜无黄染，双侧瞳孔等大等圆，对光反射灵敏，外耳道无异常分泌物，鼻外观无畸形，口唇红润，伸舌居中，双侧扁桃体正常，表面未见脓性分泌物，颈软，无抵抗感，双侧颈静脉正常，气管居中，甲状腺未及肿大，未闻及血管杂音。胸廓正常，双肺呼吸音清晰，未闻及干、湿啰音，未闻及胸膜摩擦音。心界不大，心率62次/分，心律齐整，心音有力，各瓣膜听诊区未闻及杂音，未闻及心包摩擦音。脉搏规整，无水冲脉、枪击音、毛细血管搏动征。腹部平坦，无腹壁静脉显露，无胃肠型和蠕动波，腹部柔软，无压痛、反跳痛，肝脏未触及，脾脏未触及，未触及腹部包块，麦氏点无压痛及反跳痛，Murphy's征－，肾脏未触及，肝浊音界正常，无明显肾区叩击痛，肝脾区无明显叩击痛，腹部叩诊鼓音，移动性浊音-，肛门及外生殖器未查，脊柱生理弯曲存在，四肢无畸形、无杵状指、趾，双下肢无水肿。生理反射存在，病理反射未引出。", "辅助检查": "心电图示：ST改变"
    【答案】：['三七粉', '黄连', '茵陈', '丹参', '厚朴', '大腹皮', '红花', '酒当归', '酒大黄', '红参片', '川芎', '麸炒苍术', '麸炒白术', '赤芍']
    #请你参考以上示例，从以下患者的临床信息中推荐一组中草药用作中药处方：{data["disease_case"]}
    '''
    cot_prompt = f'''
    请根据患者的基本信息和健康情况，给患者推荐一组中草药用作中药处方。
    ##注意：
    1.用数组形式输出推荐的一组中草药，不要输出其他格式和内容
    2.严格使用医学专业表达
    3.禁用markdown格式
    ##请参考以下示例：
    【患者的临床信息】："性别": "男", "职业": "职员", "年龄": "45岁", "婚姻": "已婚", "病史陈述者": "本人", "发病节气": "清明", "主诉": "发作性胸闷，烦躁2年余，加重1月余", "症状": "胸闷心慌，烦躁不适，纳呆腹胀，纳差，眠差易醒，二便调。", "中医望闻切诊": "中医望闻切诊：表情自然，面色红润，形体正常，望态，语气清，气息平，无异常气味，舌红、苔黄腻,舌下脉络正常,脉弦。", "病史": "现病史，患者于1月前因无明显诱因出现胸闷，烦躁，伴随心慌，烦躁不适，纳呆腹胀，遂就诊于我院。既往史，“胃溃疡”4年余，“颈椎病”2年余，冠心病1年余、否认糖尿病等慢性疾病病史，否认肝炎、否认结核等传染病史，预防接种史不详，否认手术史、否认重大外伤史，否认输血史，否认药物过敏史、否认其他接触物过敏史，个人史，生于原籍，久居本地，无疫水、疫源接触史，无嗜酒史，无吸烟史，无放射线物质接触史，否认麻醉毒品等嗜好，否认冶游史，否认食物过敏史，否认传染病史，婚育史，适龄婚育，育有2个子女，配偶及子女均体健，家族史，父亲去世，母亲健在，母体健，有1弟1妹，弟体健，妹高血压，祖辈均有高血压病史。", "体格检查": "体温：36.2℃  脉搏：62次/分  呼吸：18次/分  血压：134/78mmHg  VTE评估类型点选评分：0分    卒中风险评估：低危患者中年男性，发育正常，营养良好，神志清楚，自主步入病房，查体合作，全身皮肤及粘膜无黄染，未见皮下出血,浅表淋巴结未及肿大。头颅五官无畸形，眼睑无水肿，巩膜无黄染，双侧瞳孔等大等圆，对光反射灵敏，外耳道无异常分泌物，鼻外观无畸形，口唇红润，伸舌居中，双侧扁桃体正常，表面未见脓性分泌物，颈软，无抵抗感，双侧颈静脉正常，气管居中，甲状腺未及肿大，未闻及血管杂音。胸廓正常，双肺呼吸音清晰，未闻及干、湿啰音，未闻及胸膜摩擦音。心界不大，心率62次/分，心律齐整，心音有力，各瓣膜听诊区未闻及杂音，未闻及心包摩擦音。脉搏规整，无水冲脉、枪击音、毛细血管搏动征。腹部平坦，无腹壁静脉显露，无胃肠型和蠕动波，腹部柔软，无压痛、反跳痛，肝脏未触及，脾脏未触及，未触及腹部包块，麦氏点无压痛及反跳痛，Murphy's征－，肾脏未触及，肝浊音界正常，无明显肾区叩击痛，肝脾区无明显叩击痛，腹部叩诊鼓音，移动性浊音-，肛门及外生殖器未查，脊柱生理弯曲存在，四肢无畸形、无杵状指、趾，双下肢无水肿。生理反射存在，病理反射未引出。", "辅助检查": "心电图示：ST改变"
    【推理过程】：1.患者是一位45岁男性，主诉为2年多的发作性胸闷和烦躁，且症状在最近一个月加重。患者的症状包括胸闷心慌，烦躁不适，纳呆腹胀，纳差，睡眠差且易醒，这些症状表明可能存在气滞、血瘀或阴阳失调等问题。
                2.患者有胃溃疡、颈椎病和冠心病史，并且没有糖尿病等慢性疾病病史，家族史中有高血压。综合考虑其年龄、病史及症状，患者可能存在气血不足、心脾两虚等病理特征。
                3.从中医望闻切诊来看，患者面色红润，舌红苔黄腻，脉弦，这表明有内热、气滞的可能，舌苔黄腻提示湿热或痰湿困扰。
                4.体格检查中，患者的生命体征基本稳定，心率正常，但心电图显示ST改变，这提示可能存在心血管系统的问题，进一步证明有气滞血瘀的可能。
                5.根据这些症状和体征，患者的病理状态可以归纳为气滞血瘀，可能合并湿热，适合使用三七粉、黄连、茵陈等清热解毒、活血化瘀的中药。丹参、红花、川芎等可帮助活血化瘀，改善循环。厚朴、大腹皮和麸炒苍术、白术有助于健脾利湿，调理气机。
                6.结合患者的具体情况和证候，推荐的中药方剂包括：三七粉、黄连、茵陈、丹参、厚朴、大腹皮、红花、酒当归、酒大黄、红参片、川芎、麸炒苍术、麸炒白术和赤芍。
    【答案】：['三七粉', '黄连', '茵陈', '丹参', '厚朴', '大腹皮', '红花', '酒当归', '酒大黄', '红参片', '川芎', '麸炒苍术', '麸炒白术', '赤芍']
    #请你参考以上思考方式，从以下患者的临床信息中推荐一组中草药用作中药处方：{data["disease_case"]}
    '''
    match prompt_type:
        case 0:
            prompt = zero_shot_prompt
        case 1:
            prompt = few_shot_prompt
        case 2:
            prompt = cot_prompt
        case _:
            prompt = ""
    response = llm.chat(prompt)
    data["answer"] = response

    return data
